<p style="text-align:center">
    <a href="https://skills.network/?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDS0321ENSkillsNetwork865-2022-01-01" target="_blank">
    <img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/assets/logos/SN_web_lightmode.png" width="200" alt="Skills Network Logo"  />
    </a>
</p>

<h1 align=center><font size = 5>Assignment: SQL Notebook for Peer Assignment</font></h1>

Estimated time needed: **60** minutes.

## Introduction
Using this Python notebook you will:

1.  Understand the Spacex DataSet
2.  Load the dataset  into the corresponding table in a Db2 database
3.  Execute SQL queries to answer assignment questions

In [ ]:
import numpy as np
import pandas as pd

## Overview of the DataSet

SpaceX has gained worldwide attention for a series of historic milestones. 

It is the only private company ever to return a spacecraft from low-earth orbit, which it first accomplished in December 2010.
SpaceX advertises Falcon 9 rocket launches on its website with a cost of 62 million dollars wheras other providers cost upward of 165 million dollars each, much of the savings is because Space X can reuse the first stage. 


Therefore if we can determine if the first stage will land, we can determine the cost of a launch. 

This information can be used if an alternate company wants to bid against SpaceX for a rocket launch.

This dataset includes a record for each payload carried during a SpaceX mission into outer space.

### Download the datasets

This assignment requires you to load the spacex dataset.

In many cases the dataset to be analyzed is available as a .CSV (comma separated values) file, perhaps on the internet. Click on the link below to download and save the dataset (.CSV file):

 <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv" target="_blank">Spacex DataSet</a>

**Navigate to the Go to UI screen** 

* Refer to this insruction in this <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Sign%20up%20for%20IBM%20Cloud%20-%20Create%20Db2%20service%20instance%20-%20Get%20started%20with%20the%20Db2%20console/instructional-labs.md.html">link</a> for viewing  the   Go to UI screen. 


* Later click on **Data link(below SQL)**  in the Go to UI screen  and click on **Load Data** tab.  



* Later browse for the downloaded spacex file.



<img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/images/browsefile.png" width="800">


* Once done select the schema andload the file.  


 <img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/images/spacexload3.png" width="800">


If you are facing a problem in uploading the dataset (which is a csv file), you can follow the steps below to upload the .sql file instead of the CSV file:

* Download the file <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/datasets/Spacex%20.sql">Spacex.sql</a>

* Later click on **SQL** in the  **Go to UI Screen**.

* Use the **From file** option to browse for the **SQL** file and upload it.

<img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/images/sqlfile.png">

* Once you upload the script,you can use the **Run All** option to run all the queries to insert the data.

<img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/images/runall.png">

In [ ]:
data = pd.read_csv("Spacex.csv")
data.head()

In [ ]:
!pip install sqlalchemy==1.3.9
!pip install ibm_db_sa
!pip install ipython-sql

In [ ]:
import mysql
from sqlalchemy import create_engine

In [ ]:
# Credentials to database connection
hostname="localhost"
dbname="spacex"
uname="root"
pwd="Mystatus!29"

# Create SQLAlchemy engine to connect to MySQL Database
engine = create_engine("mysql+pymysql://{user}:{pw}@{host}/{db}".format(host=hostname, db=dbname, user=uname, pw=pwd))

# Convert dataframe to sql table                                   
#data.to_sql('spacex_data', engine, index=False)
# here city is table name created automatically in database.

### Connect to the database

Let us first load the SQL extension and establish a connection with the database

In [ ]:
%load_ext sql




**DB2 magic in case of  UI service credentials.**



<img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/images/servicecredentials.png" width="600">  

* Use the following format.

* Add security=SSL at the end

**%sql ibm_db_sa://my-username:my-password@my-hostname:my-port/my-db-name?security=SSL**

In [ ]:
hostname="localhost"
dbname="spacex"
uname="root"
pwd="Mystatus!29"

In [ ]:
import os
import pymysql
import MySQLdb

In [ ]:
%load_ext sql
%config SqlMagic.autopandas=True
%sql mysql://root:Mystatus!29@localhost/spacex

In [ ]:
%%sql  
SELECT * FROM spacex_data limit 5;

In [ ]:
#%sql select COMMUNITY_AREA_NAME from chicagocensusdata \
#where PER_CAPITA_INCOME < 11000;

## Tasks

Now write and execute SQL queries to solve the assignment tasks.

### Task 1




##### Display the names of the unique launch sites  in the space mission

In [ ]:
#data["Launch_Site"].value_counts()
%sql select distinct(Launch_Site) from spacex.spacex_data;


### Task 2


#####  Display 5 records where launch sites begin with the string 'CCA'

In [ ]:
# data[data["Launch_Site"].str.contains('CCA')]
%sql select * from spacex.spacex_data where Launch_Site like 'CCA%'

### Task 3




##### Display the total payload mass carried by boosters launched by NASA (CRS)

In [ ]:
#data[data["Customer"] == 'NASA (CRS)']["PAYLOAD_MASS__KG_"].sum()
%sql select sum(PAYLOAD_MASS__KG_) from spacex_data where Customer like 'NASA (CRS)'

### Task 4




##### Display average payload mass carried by booster version F9 v1.1

In [ ]:
#F9 v1.1
#data[data["Booster_Version"] == "F9 v1.1"]["PAYLOAD_MASS__KG_"].mean()
%sql select Booster_Version, avg(PAYLOAD_MASS__KG_) as `Average Payload Mass` from spacex_data where Booster_Version like 'F9 v1.1'

### Task 5

##### List the date when the first successful landing outcome in ground pad was acheived.


_Hint:Use min function_

In [47]:
%sql select min(Date), `Landing _Outcome` from spacex_data where `Landing _Outcome` like 'Success (ground pad)'

 * mysql://root:***@localhost/spacex
1 rows affected.

    min(Date)      Landing _Outcome
0  01-05-2017  Success (ground pad)

In [ ]:
data["Date"] = pd.to_datetime(data["Date"], infer_datetime_format=True)
data

In [48]:
data[data["Landing _Outcome"] == "Success (ground pad)"].sort_values("Date").head(1)

,Date,Time (UTC),Booster_Version,Launch_Site,Payload,PAYLOAD_MASS__KG_,Orbit,Customer,Mission_Outcome,Landing _Outcome
19,2015-12-22,01:29:00,F9 FT B1019,CCAFS LC-40,OG2 Mission 2 11 Orbcomm-OG2 satellites,2034,LEO,Orbcomm,Success,Success (ground pad)

### Task 6

##### List the names of the boosters which have success in drone ship and have payload mass greater than 4000 but less than 6000

In [64]:
data[(data["Landing _Outcome"] == "Success (drone ship)") & ((data["PAYLOAD_MASS__KG_"] > 4000) & (data["PAYLOAD_MASS__KG_"] < 6000))]["Booster_Version"]

23       F9 FT B1022
27       F9 FT B1026
31    F9 FT  B1021.2
42    F9 FT  B1031.2
Name: Booster_Version, dtype: object

In [70]:
%sql select `Landing _Outcome`, PAYLOAD_MASS__KG_, Booster_Version from spacex_data \
where `Landing _Outcome` like 'Success (drone ship)' and PAYLOAD_MASS__KG_ between 4000 and 6000;

 * mysql://root:***@localhost/spacex
4 rows affected.

       Landing _Outcome  PAYLOAD_MASS__KG_ Booster_Version
0  Success (drone ship)               4696     F9 FT B1022
1  Success (drone ship)               4600     F9 FT B1026
2  Success (drone ship)               5300  F9 FT  B1021.2
3  Success (drone ship)               5200  F9 FT  B1031.2

### Task 7




##### List the total number of successful and failure mission outcomes

In [75]:
data[data["Mission_Outcome"].str.contains("Success")]["Mission_Outcome"].count()

100

In [78]:
data[data["Mission_Outcome"].str.contains("Failure")]["Mission_Outcome"].count()

1

In [100]:
%sql select Mission_Outcome, count(Mission_Outcome) as Total from spacex_data group by Mission_Outcome;

 * mysql://root:***@localhost/spacex
4 rows affected.

                    Mission_Outcome  Total
0                           Success     98
1               Failure (in flight)      1
2  Success (payload status unclear)      1
3                          Success       1

### Task 8



##### List the   names of the booster_versions which have carried the maximum payload mass. Use a subquery

In [105]:
data[data["PAYLOAD_MASS__KG_"] == data['PAYLOAD_MASS__KG_'].max()]['Booster_Version']

74     F9 B5 B1048.4
77     F9 B5 B1049.4
79     F9 B5 B1051.3
80     F9 B5 B1056.4
82     F9 B5 B1048.5
83     F9 B5 B1051.4
85     F9 B5 B1049.5
92    F9 B5 B1060.2
93    F9 B5 B1058.3
94     F9 B5 B1051.6
95     F9 B5 B1060.3
99    F9 B5 B1049.7
Name: Booster_Version, dtype: object

In [108]:
%sql select Booster_Version from spacex_data where PAYLOAD_MASS__KG_ like (select max(PAYLOAD_MASS__KG_) from spacex_data)

 * mysql://root:***@localhost/spacex
12 rows affected.

   Booster_Version
0    F9 B5 B1048.4
1    F9 B5 B1049.4
2    F9 B5 B1051.3
3    F9 B5 B1056.4
4    F9 B5 B1048.5
5    F9 B5 B1051.4
6    F9 B5 B1049.5
7   F9 B5 B1060.2
8   F9 B5 B1058.3
9    F9 B5 B1051.6
10   F9 B5 B1060.3
11  F9 B5 B1049.7

### Task 9


##### List the failed landing_outcomes in drone ship, their booster versions, and launch site names for in year 2015

In [115]:
data[(data["Date"].dt.year == 2015) & (data["Landing _Outcome"] == 'Failure (drone ship)')][["Landing _Outcome","Booster_Version","Launch_Site"]]

        Landing _Outcome Booster_Version  Launch_Site
13  Failure (drone ship)   F9 v1.1 B1012  CCAFS LC-40
16  Failure (drone ship)   F9 v1.1 B1015  CCAFS LC-40

In [120]:
# %sql select year(Date) from spacex_data;

 * mysql://root:***@localhost/spacex
101 rows affected.

    year(Date)
0         None
1         None
2         None
3         None
4         None
..         ...
96        None
97        None
98        None
99        None
100       None

[101 rows x 1 columns]

### Task 10

##### Rank the count of landing outcomes (such as Failure (drone ship) or Success (ground pad)) between the date 2010-06-04 and 2017-03-20, in descending order

### Reference Links

* <a href ="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20String%20Patterns%20-%20Sorting%20-%20Grouping/instructional-labs.md.html?origin=www.coursera.org">Hands-on Lab : String Patterns, Sorting and Grouping</a>  

*  <a  href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Built-in%20functions%20/Hands-on_Lab__Built-in_Functions.md.html?origin=www.coursera.org">Hands-on Lab: Built-in functions</a>

*  <a  href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Sub-queries%20and%20Nested%20SELECTs%20/instructional-labs.md.html?origin=www.coursera.org">Hands-on Lab : Sub-queries and Nested SELECT Statements</a>

*   <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-3-SQLmagic.ipynb">Hands-on Tutorial: Accessing Databases with SQL magic</a>

*  <a href= "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-4-Analyzing.ipynb">Hands-on Lab: Analyzing a real World Data Set</a>

## Author(s)

<h4> Lakshmi Holla </h4>

## Other Contributors

<h4> Rav Ahuja </h4>

## Change log
| Date | Version | Changed by | Change Description |
|------|--------|--------|---------|
| 2021-10-12 | 0.4 |Lakshmi Holla | Changed markdown|
| 2021-08-24 | 0.3 |Lakshmi Holla | Added library update|
| 2021-07-09 | 0.2 |Lakshmi Holla | Changes made in magic sql|
| 2021-05-20 | 0.1 |Lakshmi Holla | Created Initial Version |

In [129]:
%sql select payload_mass__kg_ from spacex_data where payload_mass__kg_=(select max(payload_mass__kg_) from spacex_data) LIMIT 1

 * mysql://root:***@localhost/spacex
1 rows affected.

   payload_mass__kg_
0              15600

In [130]:
%sql select payload_mass__kg_ from spacex_data order by payload_mass__kg_ desc LIMIT 1

 * mysql://root:***@localhost/spacex
1 rows affected.

   payload_mass__kg_
0              15600

In [133]:
data["Launch_Site"].value_counts()

CCAFS SLC-40    34
CCAFS LC-40     26
KSC LC-39A      25
VAFB SLC-4E     16
Name: Launch_Site, dtype: int64

## <h3 align="center"> © IBM Corporation 2021. All rights reserved. <h3/>